update docs, refactor yaml inputs
